# GetAssociatedPartMaker Method (Document, LinkElementId) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PartUtils..::..GetAssociatedPartMaker Method (Document, LinkElementId)
PartUtils Class See Also
---
Gets associated PartMaker for an element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static PartMaker GetAssociatedPartMaker(
	Document hostDocument,
	LinkElementId hostOrLinkElementId
)
```

Visual Basic
---
```text
Public Shared Function GetAssociatedPartMaker ( _
	hostDocument As Document, _
	hostOrLinkElementId As LinkElementId _
) As PartMaker
```

Visual C++
---
```text
public:
static PartMaker^ GetAssociatedPartMaker(
	Document^ hostDocument,
	LinkElementId^ hostOrLinkElementId
)
```

# ### Parameters
hostDocument
    Type: Autodesk.Revit.DB..::..Document The document
hostOrLinkElementId
    Type: Autodesk.Revit.DB..::..LinkElementId The id for the element to be checked for associated Parts
# ### Return Value
The PartMaker element that is making Parts for this element. nullNothingnullptra null reference (Nothing in Visual Basic) if there is no associated PartMaker.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
PartUtils Class
GetAssociatedPartMaker Overload
Autodesk.Revit.DB Namespace